import 'package:flutter/material.dart';
import '../animation.dart';
import 'animation.dart';


class Earth extends StatelessWidget {
  const Earth({super.key});
  @override
  Widget build(BuildContext context) {
    final List<Map<String, String>> images = [
      {"image": "assets/Earth.jpg", "title": ""},
      {"image": "assets/Create_the_earth_planet_on_the_space.png", "title": ""},
      {"image": "assets/Earth1.jpg", "title": ""},
      {"image": "assets/Earth2.jpg", "title": ""},
      {"image": "assets/Earth3.jpg", "title": ""},
      {"image": "assets/Earth4.jpg", "title": ""},
      {"image": "assets/Earth5.jpg", "title": ""},

    ];
    return Scaffold(
      appBar: AppBar(
        centerTitle: false,
        title: Text(
          'زمین',
          style: Theme.of(context)
              .textTheme
              .titleLarge!
              .copyWith(fontWeight: FontWeight.bold,color: Colors.white),
        ),
      ),
      body: SafeArea(
        child: Stack(
          children: [
            const Positioned.fill(child: DrawerAnimation()),
            Scrollbar(
              radius: const Radius.circular(10),
              child: SingleChildScrollView(
                child: Column(
                  children: [
                    Container(
                      width: double.maxFinite,
                      height: 200,
                      padding: const EdgeInsets.all(10),
                      child: CustomCarousel(
                        visible: 3,
                        borderRadius: 20,
                        slideAnimationDuration: 500,
                        titleFadeAnimationDuration: 300,
                        childClick: (int index) {
                          print("Clicked $index");
                        },
                        children: images,
                      ),
                    ),
                    Padding(
                      padding: EdgeInsets.all(MediaQuery.of(context).size.width /20),
                      child: const Text("زمین، سیاره‌ای است که ما در آن زندگی می‌کنیم. این سیاره سومین سیاره از خورشید در سامانهٔ شمسی ما واقع شده است. زمین یکی از سیارات سنگی است و دارای اندازه و جرم مناسبی است که شرایط مناسبی برای حیات را فراهم کند. در ادامه، به برخی از ویژگی‌ها و معلومات مهم دربارهٔ زمین می‌پردازم: \n1.  ساختار زمین: زمین به سه لایه اصلی تقسیم می‌شود. لایهٔ بیرونی زمین را پوسته یا پوستهٔ زمین می‌نامند که شامل قاره‌ها، اقیانوس‌ها و سنگ‌های قاره‌ای است. در زیر پوستهٔ زمین، لایهٔ میانی به نام مانتل است که شامل سنگ‌های داغ و ذوب شده است. در نهایت، هستهٔ زمین، که شامل فلزات سنگین مانند آهن و نیکل است، در مرکز زمین قرار دارد. \n2.  ابعاد و جرم: قطر متوسط زمین حدود ۱۲۷۵۰ کیلومتر است و جرم آن حدود ۵.۹۷ × ۱۰^۲۴ کیلوگرم است. این ابعاد و جرم، زمین را به اندازهٔ مناسبی برای حفظ جاذبهٔ خود و ایجاد شرایط مناسب برای زندگی توسعه داده است. \n 3.  جو و اقلیم: زمین دارای جوی غلیظ است که از مخلوطی از گازهایی مانند نیتروژن، اکسیژن و دی‌اکسید کربن تشکیل شده است. این جو عملکردهای مهمی را انجام می‌دهد، از جمله حفظ حرارت و حمایت از زندگی با ایجاد جوانه‌زنی و تغذیهٔ گیاهان و جانداران. \n 4.  آب و اقیانوس‌ها: زمین دارای سطحی از آب است که تقریباً ۷۱٪ سطح آن را پوشش می‌دهد. اقیانوس‌ها، که به عنوان منابع اصلی آب شیرین و محیط زندگی بسیاری از موجودات زنده عمده اقیانوس‌ها به حساب می‌آیند. \n 5. زندگی: زمین تنها سیاره شناخته شده است که در آن زندگی وجود دارد. انواع مختلفی از گیاهان، جانوران و میکروب‌ها در سطح زمین و در محیط‌های مختلفی از قاره‌ها تا اقیانوس‌ها وجود دارند. این شامل تنوع زیستی فراوانی از جمله جانوران بزرگ، کوچک، پرنده‌ها، ماهی‌ها، گیاهان، باکتری‌ها و غیره می‌شود. \n 6. جغرافیا: زمین دارای تنوع جغرافیایی بسیار است. این شامل کوهستان‌ها، صحراها، جنگل‌ها، رودخانه‌ها، دریاها، دره‌ها و مناظر طبیعی دیگر است. تنوع جغرافیایی زمین اثرات زیستی، اقتصادی و اجتماعی زیادی دارد و جاذبهٔ گردشگری قوی را به وجود می‌آورد. \n 7. تأثیرات انسانی: انسان‌ها نیز تأثیرات قابل توجهی بر روی زمین داشته‌اند. فعالیت‌هایی مانند صنعتی‌سازی، کشاورزی، شهرنشینی و تخریب محیط زیست تأثیراتی را بر روی اقلیم، تنوع زیستی و منابع طبیعی زمین گذاشته است. \n 8. پوشش گیاهی: زمین دارای پوشش گیاهی متنوعی است که در حفظ تعادل اکولوژیکی و تأمین منابع غذایی برای جانوران و انسان‌ها نقش مهمی دارد. انواع گیاهان شامل درختان، گیاهان علفی، شرابه‌ها، خزه‌ها و گیاهان آبزی است. \n 9. آب و هیدروژئولوژی: زمین دارای سیستم های آبی طبیعی متنوعی است. رودخانه ها،‌دریاچه ها، آبگیرها، چشمه‌ها و یخچال‌ها از جمله اجزای این سیستم‌ها هستند. چرخهٔ آب شامل تبخیر، تبدیل به ابر و بارش، سفر در رودخانه‌ها و انتقال به دریاها را شامل می‌شود.\n 10. زلازل و فعالیت‌های زمین‌شناسی: زمین فعالیت‌های زمین‌شناسی متعددی را تجربه می‌کند، از جمله زلازل، آتشفشان‌ها، جبهه‌های لغزشی و تشکیل کوهستان‌ها. این فعالیت‌ها تأثیر قابل توجهی بر شکل‌گیری زمین و تغییرات آن داشته‌اند. \n 11. جوامع بشری: زمین محل زندگی میلیاردها نفر از جمله جوامع بشری است. انسان‌ها در طول تاریخ برای بقا و توسعه به منابع زمین نیاز داشته‌اند و تأثیرات قابل توجهی بر روی زمین و محیط زیست داشته‌اند. \n 12. تغییرات اقلیمی: فعالیت‌های انسانی، از جمله افزایش گازهای گلخانه‌ای در جو، تأثیرات قابل توجهی بر روی اقلیم زمین داشته است. این تغییرات اقلیمی شامل افزایش دما، ذوب یخچال‌ها، تغییر الگوی بارش و اثرات جانبی مانند افزایش خشکسالی‌ها و بلندمدت‌تر شدن فصل آتش‌سوزی‌ها می‌شود.\n 13.  منابع طبیعی: زمین منابع طبیعی گوناگونی دارد که برای بقا و توسعه انسان‌ها بسیار اساسی هستند. این منابع شامل آب، خاک، مواد معدنی، سوخت‌هایافسونی، گیاهان و جانوران و منابع آبزی است. برخی از مثال‌های منابع طبیعی عبارتند از: ذخایر نفت و گاز، معادن مختلف (مانند طلا، نقره، مس، آهن و زغال سنگ)، منابع آبی (نظیر رودخانه‌ها و دریاچه‌ها) و جنگل‌ها و پوشش گیاهی. \n14. محیط زیست و حفاظت: حفظ محیط زیست زمین از اهمیت بالای برخوردار است. تخریف زمین، کاهش تنوع زیستی، آلودگی هوا و آب، تخریب جنگل‌ها و تغییرات اقلیمی تهدیدهایی هستند که بر محیط زیست زمین اثرات مخربی دارند. بنابراین، حفاظت از زمین و حفظ تعادل اکولوژیکی از ضرورت‌های جهانی است. \n اهمیت زمین به عنوان خانهٔ ما و ارتباط ما با آن، از طریق محافظت از محیط زیست، حفظ تنوع زیستی و استفاده پایدار از منابع طبیعی، بسیار مهم است.",style: TextStyle(fontSize: 18,),textDirection: TextDirection.rtl,textAlign: TextAlign.justify,),
                    ),
                  ],
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }
}


