import 'dart:ui';
import 'package:flutter/material.dart';

import '../Animations.dart';
import 'Animation.dart';

class Mars extends StatelessWidget {
  const Mars({super.key});
  @override
  Widget build(BuildContext context) {
    final List<Map<String, String>> images = [
      {"image": "assets/Mars.jpg", "title": ""},
      {"image": "assets/Mars1.jpg", "title": ""},
      {"image": "assets/Mars2.jpg", "title": ""},
      {"image": "assets/Mars3.jpg", "title": ""},
      {"image": "assets/Mars4.jpg", "title": ""},
      {"image": "assets/Mars5.jpg", "title": ""},
    ];
    return Scaffold(
      appBar: AppBar(
        centerTitle: false,
        title: Text(
          'مریخ',
          style: Theme.of(context)
              .textTheme
              .titleLarge!
              .copyWith(fontWeight: FontWeight.bold, color: Colors.white),
        ),
      ),
      body: SafeArea(
        child: Stack(
          children: [
            Positioned.fill(child: DrawerAnimation()),
            Scrollbar(
              radius: Radius.circular(10),
              child: SingleChildScrollView(
                child: Column(
                  children: [
                    Container(
                      width: double.maxFinite,
                      height: 200,
                      padding: const EdgeInsets.all(10),
                      child: CustomCarousel(
                        visible: 3,
                        borderRadius: 20,
                        slideAnimationDuration: 500,
                        titleFadeAnimationDuration: 300,
                        childClick: (int index) {
                          print("Clicked $index");
                        },
                        children: images,
                      ),
                    ),
                    Padding(
                      padding: EdgeInsets.all(MediaQuery.of(context).size.width / 20),
                      child: const Text(
                        "به عنوان یک سیاره، مریخ یک محیط بسیار جذاب و مورد توجه برای مطالعه و بررسی علمی است. اینجا چند توضیح کامل‌تر درباره موضوعاتی که ذکر کردید را ارائه می‌دهم: \n 1.  زیبایی های مریخ: سطح مریخ دارای چشم انداز های فراوانی است که شامل کوسهتان ها، دره ها، دره‌ها، صحراها، کراترها و دشت‌ها می‌شود. به عنوان مثال، (واله مارینریس) یک دره بزرگ و عمیق است که به عنوان یکی از زیباترین مناظر سطحی مریخ شناخته می‌شود.\n 2. جای‌های خطرناک: مریخ همچنین دارای جاهای خطرناکی است که ممکن است برای مأموریت‌های فضایی چالش‌برانگیز باشند. به عنوان مثال، (شیروا) که یک کراتر بسیار عمیق است و (والز) که یک صحرای شنی و بادی است، جزء این مناطق خطرناک می‌باشند.\n 3.ادامه حیات: در حال حاضر، نمی‌توان ادعا کرد که مریخ شرایط مناسبی برای حیات دارد. با توجه به شرایط سخت و خشکی که در مریخ وجود دارد، زندگی به شکلی که ما آن را می‌شناسیم، غیرممکن به نظر می‌رسد. اما با توجه به مطالعاتی که از مریخ انجام شده است، ممکن است در گذشته اقلیمی ملایم‌تر و شرایطی مساعدتر برای زندگی میکروبی در مریخ وجود داشته باشد. \n 4. مأموریت‌های آینده: علمای فضایی و سازمان‌های فضایی در حال برنامه‌ریزی برای اکتشاف و بررسی بیشتر مریخ هستند. مأموریت‌های آینده شامل ارسال روبات‌ها و ابزارهای پیشرفته‌تر برای بررسی سطح، حفر در خاک و جستجوی نشانه‌های احتمالی حیات در گذشته مریخ می‌شوند. همچنین، برنامه‌هایی برای ارسال انسان به مریخ نیز در دستور کار برخی سازمان‌های فضایی قرار دارد.\n 5. موقعیت و خصوصیات: مریخ چهارمین سیاره از خورشید و در فاصله‌ای حدود ۲۲۹ میلیون کیلومتری از خورشید قرار دارد. قطر میانگین مریخ حدود ۶٬۷۹۵ کیلومتر است که حدود نیم قطر زمین است. مریخ دارای جاذبه‌ای کمتر از زمین است و شتاب جاذبه‌ای سطحی آن تقریباً ۳٫۷ متر بر مربع ثانیه است.\n 6. ظاهر و رنگ: مریخ به دلیل وجود اکسید آهن در خاک سطحی‌اش، رنگ قرمزی مشهوری دارد و به عنوان (سیاره قرمز) نیز شناخته می‌شود. \n 7. جو مریخ: مریخ یک جوی بسیار نازک دارد که از اکسیژن، نیتروژن، آرگون و دی اکسید کربن تشکیل شده است. جوی نازک مریخ نسبت به جوی غلیظ زمین، تأثیر کمتری روی دمای سطحی سیاره دارد و باعث می‌شود که دماها به طور قابل توجه‌ای پایین‌تر از زمین باشند. \n 8. آب و منابع آبی: در گذشته، مریخ ممکن است آبی در سطح خود داشته باشد. اما در حال حاضر، آب مایع در سطح سیاره وجود ندارد و آب به صورت یخ یا همزمانی با موجودیت‌های شیمیایی دیگر یافت می‌شود.\n 9. آب و همچنین شرایط زندگی: مطالعات نشان می‌دهد که در گذشته مریخ شرایطی مساعدتر برای زندگی میکروبی داشته است. برخی شواهد نشان می‌دهد که آب زیر سطحی ممکن است در مریخ وجود داشته باشد و نمونه‌هایی از آب یخ بر روی قطب‌های مریخ هم مشاهده شده است.\n 10. برسی های فضایی: مریخ یکی از سیاره های مورد علاقه برای بررسی و اکتشاف فضایی است. بسیاری از مأموریت‌های فضایی از جمله مأموریت‌های روی سطح مریخ توسط وکال ها (مثل مأموریت راورس) و مأموریت‌های دیگر مأموریت‌های فضایی برای بررسی ساختار جغرافیایی، جو،زمین‌شناسی، اقلیم و جستجوی نشانه‌های حیات در گذشته مریخ صورت گرفته‌اند. همچنین، برنامه‌هایی برای ارسال انسان به مریخ نیز در دستور کار برخی سازمان‌های فضایی قرار دارد. \n 11. مأموریت مریخ ناسا: ناسا، سازمان فضایی آمریکا، مدتی است که به بررسی مریخ اختصاص داده است. مأموریت مشهور مریخ ناسا شامل مأموریت‌هایی مانند روور (رووروز که در سال ۲۰۲۱ به مریخ رسید)، پرسیورنس (که در سال ۲۰۲۰ به مریخ رسید) و اینسایت (که در سال ۲۰۱۸ به مریخ رسید) بوده است. \n در کل، مریخ به عنوان یک سیاره مورد توجه بسیاری از محققان و علاقه‌مندان به فضا است. بررسی زیبایی‌های سطحی، مکان‌های خطرناک، امکان وجود حیات در گذشته و برنامه‌های آینده برای اکتشاف مریخ، همگی موضوعاتی هستند که مورد بحث و بررسی قرار می‌گیرند.",
                        style: TextStyle(
                          fontSize: 18,
                        ),
                        textDirection: TextDirection.rtl,
                        textAlign: TextAlign.justify,
                      ),
                    ),
                    Padding(
                      padding: EdgeInsets.all(MediaQuery.of(context).size.width / 20),
                      child: const Text(
                        "",
                        style: TextStyle(
                          fontSize: 18,
                        ),
                        textDirection: TextDirection.rtl,
                        textAlign: TextAlign.justify,
                      ),
                    ),
                  ],
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }
}
