import 'package:flutter/material.dart';

import '../animation.dart';
import 'animation.dart';


class Neptun extends StatelessWidget {
  const Neptun({super.key});
  @override
  Widget build(BuildContext context) {
    final List<Map<String, String>> images = [
      {"image": "assets/Neptun.jpg", "title": ""},
      {"image": "assets/Neptun1.jpg", "title": ""},
      {"image": "assets/Neptun2.jpg", "title": ""},
      {"image": "assets/Neptun3.jpg", "title": ""},
      {"image": "assets/Neptun4.jpg", "title": ""},
      {"image": "assets/nepton.jpg", "title": ""},
    ];
    return Scaffold(
      appBar: AppBar(
        centerTitle: false,
        title: Text(
          'نپتون',
          style: Theme.of(context)
              .textTheme
              .titleLarge!
              .copyWith(fontWeight: FontWeight.bold,color: Colors.white),
        ),
      ),
      body: SafeArea(
        child: Stack(
          children: [
            const Positioned.fill(child: DrawerAnimation()),
            Scrollbar(
              radius: const Radius.circular(10),
              child: SingleChildScrollView(
                child: Column(
                  children: [
                    Container(
                      width: double.maxFinite,
                      height: 200,
                      padding: const EdgeInsets.all(10),
                      child: CustomCarousel(
                        visible: 3,
                        borderRadius: 20,
                        slideAnimationDuration: 500,
                        titleFadeAnimationDuration: 300,
                        children: images,
                      ),
                    ),
                    Padding(
                      padding: EdgeInsets.all(MediaQuery.of(context).size.width /20),
                      child: const Text("نپتون (به انگلیسی: Neptune) هشتمین سیارهٔ منظومه شمسی (و با در نظر نگرفتن پلوتو که یک سیاره کوتوله است) دورترین سیاره شناخته شده می‌باشد. پس از مشتری، زحل و اورانوس، نپتون بزرگ‌ترین سیاره از لحاظ اندازه می‌باشد. نپتون به همراه سیاره کوتوله پلوتو تنها سیاره‌هایی هستند که از زمین با چشم غیرمسلح رویت نمی‌شوند چون فاصله خورشید تا نپتون حدود سی برابر فاصله زمین تا خورشید است. در میان غول‌های گازی، چگالی نپتون از همه بیشتر است و به همین دلیل کوچک‌ترین اندازه را میان سیاره‌های هم‌ردیف خود دارد. جرم نپتون به تنهایی ۱۷ برابر جرم زمین است و قطر آن با اندازه ۴۹٬۵۲۸ کیلومتر چهار برابر قطر زمین می‌باشد. هر سال در نپتون معادل ۱۶۵ سال زمینی است ولی یک دور گردش وضعی این سیاره در مدت ۱۶ ساعت و ۷ دقیقه انجام می‌گیرد. نام نپتون از نام خدای رومی دریاها گرفته شده و دلیل این نامگذاری رنگ آبی پررنگی است که باعث زیبایی منحصربفرد این سیاره سرد می‌شود.\n\n\n ویژگی ها:\n معمولاً همه انسان‌های روی زمین این سیاره را به رنگ آبی می‌شناسند. این رنگ را گاز متان حاضر در جو نپتون که رنگ سرخ را جذب می‌کند و آبی‌حاصل از طیف نوری خورشید که بازتابیده می‌شود پدید می‌آید.\n نپتون از نظر ساختاری بسیار شبیه به سایر سیارات گازی به خصوص اورانوس است. تفاوتی که در ساختار سیاره‌هایی مانند اورانوس و نپتون دیده می‌شود، به سبب عدم حضور هیدروژن فلزی مایع است که در عوض آن یک ساختار متراکم آب مانندی در اطراف هسته وجود دارد. لایه بیرونی‌تر نپتون متشکل از هیدروژن ملکولی مایع و هلیوم مایع است.\n اتمسفر و جو نپتون آبی رنگ است و درصد بازتابش بالائی دارد که حاکی از وجود یک جو غلیظ است. برابر با نتیجه بررسی‌ها حضور مقداری متان نیز در این سیاره تأیید شده‌است. در کل، ترکیبات جو این سیاره به مانند سایر سیارات غول پیکر گازی شامل ۸۰ تا ۸۵ درصد هیدروژن و ۱۵ تا ۱۹ درصد هلیوم است.\nیک بار گردش نپتون به‌دور خورشید تقریباً ۱۶۵ سال طول می‌کشد، و بنابراین از زمان کشف این سیاره در سال ۱۸۶۴ تا کنون، تنها نزدیک به یک بار به دور خورشید گردیده‌است.\nدوره تناوب نجومی این سیاره ۱۶۴٫۷۹ سال است. از زمان کشف نپتون تا کنون فقط ۷۵ درصد مدار خود را طی کرده. دوره تناوب چرخشی نپتون ۱۷ ساعت و ۵۰ دقیقه است. سرعت گریز از جاذبه این سیاره نیز در حدود ۲۳ کیلومتر در ثانیه است. نپتون دارای دو قمر بزرگ بنام‌های نریید و تریتون (قمر) است و تعداد بسیار زیادی اقمار کوچک نیز دارد.\n پیش از این انتظار می‌رفت که نپتون از نظر جوی آرام‌تر از اورانوس باشد ولی مأموریت ویجر ۲ نشان داد که بادهای نپتون بسیار بسیار شدید هستند. سرعت این بادها به ۶۴۰ کیلومتر در ساعت می‌رسد.\n \n کشف:\n اگر در حرکت سیاره اورانوس در مدارش بی‌نظمی دیده نمی‌شد، قطعاً کشف نپتون دیرتر به وقوع می‌پیوست. در سال ۱۷۹۰ میلادی اخترشناس فرانسوی ژان‌باتیست دولامبر نقشه‌ای از مدار اورانوس به دست آورد. در چند سال اول موقعیت رصد شده اورانوس نسبت به نقشه دولامبر یکی بود ولی به مرور زمان اختلافاتی میان این دو دیده شد. سرانجام دانشمندان به این نتیجه رسیدند که باید در این باره بازنگری شود. اخترشناس فرانسوی آلکسی بوار وظیفه انجام این کار را داشت. در ابتدا محاسبات او از مدار اورانوس درست به نظر می‌رسید ولی پس از مدتی میان محاسبات او و مدار واقعی اورانوس نیز تفاوت‌هایی دیده می‌شد. بوار چنین طرح کرد که سیاره‌ای دورتر از اورانوس وجود دارد و آن را از مکان محاسبه شده به عقب می‌کشد.\n جان کاوچ آدامز از سال ۱۸۴۱ به تحقیق و محاسبه دربارهٔ سیاره مجهول که فراتر از اورانوس وجود دارد پرداخت. سرانجام محاسباتش را در سپتامبر سال ۱۸۴۵ با اخترشناس مشهور سر جورج بیدل ایری در میان گذاشت؛ آدامز از ایری خواسته بود به جستجوی این سیاره در آسمان بپردازد. تا مدتی ایری این کار را انجام نداد، شاید نمی‌خواست درخواست فردی ناشناس مثل آدامز را انجام بدهد ولی سرانجام در ژوئیه سال ۱۸۴۶ از ستاره‌شناسی به نام جیمز کالیس خواست تا این کار را انجام دهد. کالیس در چهارم اوت سال ۱۸۴۶ نپتون را در آسمان دید ولی نتوانست ماهیت آن را تشخیص دهد.\n در همین هنگام ستاره‌شناس فرانسوی اوربن ژان ژوزف لو وریه به محاسبه سیاره مجهول در آسمان پرداخت. سپس محاسباتش را همراه با نامه‌ای به یوهان گاله معاون رصدخانه برلین فرستاد و از او خواست هر چه زودتر به جستجوی این سیاره در آسمان بپردازد. نامه روز ۲۳ سپتامبر سال ۱۸۴۶ به گاله رسید. او همان شب تلسکوپش را به سوی آسمان برد و سیاره را با یک درجه اختلاف نسبت به نقطه پیشنهاد شده توسط لووریه در آسمان مشاهده کرد. رصدخانه برلین به تازگی نقشه‌ای از آن بخش از آسمان به دست آورد، به همین علت کشف نپتون ممکن شده‌است.\n تا زمان بسیار طولانی مجادله بسیار ناخوشایندی بر سر این بود که چه کسی لیاقت عنوان کاشف نپتون را دارد. امروزه بیشتر ستاره‌شناسان بر این باوراند که آدامز و لووریه به دلیل انجام محاسبات پیچیده که سرانجام موجب کشف نپتون شد، کاشفان این سیاره هستند و یوهان گاله به عنوان کسی که برای نخستین بار این سیاره را رصد کرد در یادها می‌مانند.\n\n جو و آب و هوا:\n ۷۴ درصد هیدروژن، ۲۵ درصد هلیم و حدود ۱ درصد متان جو نپتون را تشکیل می‌دهند. به دلیل وجود متان در جو سیاره که به شدت نور قرمز را جذب می‌کند، نپتون این رنگ آبی دلنشین را به خود گرفته‌است. جوی از هیدروژن، هلیم و متان، گوشته‌ای از آب یخ زده، متان و آمونیاک و هسته‌ای از سنگ سیلیس ساختار نپتون را شکل می‌دهد. پس از کشف هم اطلاعات بسیار کمی دربارهٔ نپتون موجود بود تا این که در ۲۵ اوت سال ۱۹۸۹ وویجر ۲ از ۵ هزار کیلومتری این غول گازی گذشت و اطلاعات بسیار زیادی دربارهٔ این سیاره به دست آورد. برای مثال وویجر۲ کشف کرد که نپتون آب‌وهوای بسیار خشنی دارد و طوفانهای پر سرعت همه جای این سیاره وجود دارند.\n لکهٔ سیاه بزرگ، آشفته‌ترین بخش نپتون است. این لکه که بیشتر شبیه گردباد است در نیمکرهٔ جنوبی این سیاره قرار دارد. در اطراف این لکه ابرهای سفیدی وجود دارد. لکهٔ سیاه بزرگ به اندازهٔ کره زمین است و در جهت خلاف عقربه‌های ساعت می‌چرخد؛ همچنین بعضی اوقات از خود لکه‌های سیاه کوچک‌تری هم تولید می‌کند. این لکه از بسیاری جهات شبیه لکهٔ سرخ مشتری است با این فرق که در شکل و اندازهٔ آن بیشتر تغییر به وجود می‌آید. در نزدیکی قطب جنوب نپتون لکهٔ سیاه دیگری شبیه بادام، وجود دارد که آن را لکهٔ سیاه۲ می‌نامند. با این که بادهای پر سرعت تمام این سیاره را فراگرفته‌است سریع‌ترین آن‌ها در نزدیکی لکهٔ سیاه بزرگ قراردارد. در آن جا سرعت بادها به ۲٬۴۰۰ کیلومتر در ساعت می‌رسد.\n وجود بادها و طوفان‌های قوی در جو نپتون نشان می‌داد که این سیاره حرارتش را از منبع دیگری می‌گیرد. وویجر ۲ کشف کرد دمای اورانوس و نپتون مانند هم است با این تفاوت که نپتون از خورشید نسبت به اورانوس دورتر است. اما نپتون بر خلاف اورانوس حرارتی بیشتر از آنچه می‌گیرد، تابش می‌کند؛ که شاید این حرارت از دما و فشار شدیدی که از هستهٔ سنگی درون این سیاره آزاد می‌شود، به وجود می‌آید؛ بنابراین می‌توان نتیجه گرفت حرارتی که نپتون از درون خود دریافت می‌کند باعث به وجود آمدن بادها و طوفان‌های قوی در این سیاره می‌شود.\nدر نزدیکی قطب جنوب نپتون، لکهٔ سیاه دیگری به شکل بادام با نام لکهٔ سیاه۲ قرار دارد. سریع‌ترین بادهای نپتون، در نزدیکی لکهٔ سیاه بزرگ، با سرعت بیش از ۲٬۴۰۰ کیلومتر در ساعت می‌وزد. هستهٔ نپتون بسیار داغ است. حرارتی که از مرکز بیرون می‌رود، گازهای اطراف سیاره را گرم می‌کند و به بالا می‌برد؛ در ارتفاعات جو، گازها سرد شده و دوباره به پایین بازمی‌گردند. در نتیجه این حرارت و جریان همرفت، بادها و طوفان‌های شدیدی به وجود می‌آید که در نهایت متان به لایهٔ بالایی پوش کره می‌رسد؛ در اثر واکنش‌های این گاز با نور خورشید، ابرها تشکیل می‌شود. دانشمندان نام یکی از نمایان‌ترین ابرهای نپتون را که به سرعت سرتاسر سیاره را طی می‌کند، روروک گذاشته‌اند.\n روی زمین بر اثر حرارت انرژی خورشید طوفان‌ها و بادها به وجود می‌آید؛ انرژی که نپتون از خورشید می‌گیرد، هزار بار کم‌تر از زمین است. همچنین وویجر ۲ دریافته بود، اورانوس همسایهٔ نپتون، فعالیت جوی نسبتاً آرامی دارد. اورانوس آن قدر از خورشید دور بود که به نظر نمی‌رسید بتواند هوایی طوفانی داشته باشد؛ نپتون که ۱٫۶ میلیارد کیلومتر نسبت به اورانوس دورتر از خورشید بود، اگر آرام‌تر از اورانوس نبود، حداقل می‌بایست به همان آرامی باشد. {البته باتوجه به تصاویری که تلسکوپ ده متری کک در سال ۲۰۰۴ گرفت مشخص شد اورانوس هم طوفان‌هایی دارد.}\n وجود بادها و طوفان‌ها در جو نپتون نشان می‌داد، این سیاره حرارتش را از منبعی به جز خورشید تأمین می‌کند. وویجر دریافت دمای نپتون و اورانوس مشابه هم است اما نپتون بر خلاف اورانوس حرارتی بیش از آن که دریافت کند، تابش می‌کند؛ شاید این حرارت از هستهٔ داغ و سنگی مرکز سیاره به وجود می‌آید.\n \n میدان مغناطیسی:\n سیارهٔ نپتون دارای میدان مغناطیسی نسبتاً قوی است. محورهای مغناطیسی این سیاره نسبت به محورهای جغرافیایی اختلافی حدود ۴۷ درجه دارد. سیارهٔ اورانوس نیز حدوداً همین مقدار اختلاف دارد؛ به همین علت به این دو سیاره دوقلوهای مغناطیسی می‌گویند.\n \n قمر ها و حلقه ها: \nوویجر۲ دست کم پنج حلقه برای نپتون کشف کرد. این حلقه‌ها دور تا دور سیاره قرار دارند و در برخی قسمت‌ها پهن و در بعضی قسمت‌ها باریک هستند. احتمال دارد میان حلقه‌ها مواد غباری رقیقی وجود داشته باشد. این حلقه‌ها در فاصلهٔ ۲۷٬۰۰۰ تا ۳۸٬۵۰۰ کیلومتری به دور نپتون می‌چرخند.\nمدت‌ها دانشمندان تنها دو قمر از قمرهای نپتون را پیدا کرده بودند. تریتون بزرگ‌ترین ماه نپتون، در سال ۱۸۴۶ توسط ویلیام لاسل و نریید در سال ۱۹۹۴ توسط جرارد کویی‌پر کشف شدند. به این دلیل که گردش این دو قمر مهم نپتون بر خلاف گردش محوری نپتون به دور خودش است دانشمندان بر این باوراند که این دو قمر پس از به وجود آمدن سامانهٔ خورشیدی به اسارت این سیاره درآمده‌اند. وویجر۲ شش قمر دیگر را برای نپتون کشف کرد و امروزه نیز به وسیلهٔ تلسکوپ‌های زمینی پنج قمر نو نیز برای نپتون کشف کردند و نپتون دارای سیزده قمر شناخته‌شده گردید. در سال ۲۰۱۳ با رسمیت یافتن قمر کوچک اس/۲۰۰۴ ان ۱ رقم قمرهای این سیاره به ۱۴ قمر رسید.\nتریتون با دمای ۲۳۵ درجه زیر صفر بسیار سرد است ولی آن طور که دانشمندان حدس می‌زدند مرده و بی‌روح نیست. وویجر۲ سرزمینی رنگارنگ را از بزرگ‌ترین ماه نپتون به تصویر گذاشت. این قمر لکه‌های یخ زده سفید، آبی و صورتی در سطح خود دارد و پر از گسل‌ها، صخره‌ها و دهانه‌های برخوردی است، همچنین نوارهای سفید دور چاله‌ها و لکه‌های تیره این قمر را شبیه پوست طالبی کرده‌است و ظاهری زیبا را به این قمر داده‌است. بر سطح این قمر یخ فشان‌هایی قرار دارد. عملکرد این یخ فشان‌ها مانند آتش فشان‌های زمینی است ولی به جای مواد مذاب از دهانه‌یشان گاز و یخ بیرون می‌آید که فوران‌های آن تا چندین متر به بالا می‌رود.\nتلسکوپ جیمز وب تصویر هفت قمر از مجموع ۱۴ قمر شناخته‌شده در منظومه نپتون را ثبت کرده‌است. برجسته‌ترین قمر به نام تریتون، بالای سر سیاره با سنبله‌های پراش به چشم می‌خورد. تریتون به دلیل خاصیت بازتابندگی شدید ورقه‌های یخی نیتروژن که آن را پوشانده‌اند، به رنگ سبز و آبی دیده می‌شود. هایدی همل، کارشناس منظومه نپتون و دانشمند میان‌رشته‌ای جیمز وب می‌گوید: «از آخرین باری که این حلقه‌های کم‌نور و غبارآلود را دیدیم، سه دهه می‌گذرد و این نخستین‌بار است که آن‌ها را در فروسرخ مشاهده کرده‌ایم.»\n \n ساختار:\n دانشمندان بر این باورند که در داخل سیاره هسته‌ای از سنگ و بسیار داغ وجود دارد و دراطرافش نیز کره‌ای از یخ و آب و گازهای مایع و یخ زده قرار دارد؛ روی همهٔ این‌ها نیز پوشش جو سیاره وجود دارد. مرکز نپتون بسیار داغ و سوزان است و دمای آن به ۹ هزار درجه سانتی گراد بالای صفر می‌رسد. گرما بسیار زیادی که از درون این سیاره بیرون می‌آید، این سیاره را فعال نگه داشته‌است.",style: TextStyle(fontSize: 18,),textDirection: TextDirection.rtl,textAlign: TextAlign.justify,),
                    ),
                  ],
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }
}


