import 'package:flutter/material.dart';
import '../animation.dart';
import 'animation.dart';


class SpaceInfo extends StatelessWidget {
  const SpaceInfo({super.key});
  @override
  Widget build(BuildContext context) {
    final List<Map<String, String>> images = [
      {"image": "assets/download.jpg", "title": ""},
      {"image": "assets/download1.jpg", "title": ""},
      {"image": "assets/image.jpg", "title": ""},
      {"image": "assets/milky.jpg", "title": ""},
      {"image": "assets/milkyway.jpg", "title": ""},
      {"image": "assets/OIP.jpg", "title": ""},
      {"image": "assets/OIP1.jpg", "title": ""},
      {"image": "assets/space1.jpg", "title": ""},
      {"image": "assets/th.jpg", "title": ""},
      {"image": "assets/world.jpg", "title": ""},
      {"image": "assets/world1.jpg", "title": ""},
      {"image": "assets/world2.jpg", "title": ""},
    ];
    return Scaffold(
      appBar: AppBar(
        centerTitle: false,
        title: Text(
          'کــیهـان',
          style: Theme.of(context)
              .textTheme
              .titleLarge!
              .copyWith(fontWeight: FontWeight.bold,color: Colors.white),
        ),
      ),
      body: SafeArea(
        child: Stack(
         children: [
           const Positioned.fill(child: DrawerAnimation()),
           Scrollbar(
             radius: Radius.circular(10),
             child: SingleChildScrollView(
               child: Column(
                 children: [
                   Container(
                     width: double.maxFinite,
                     height: 200,
                     padding: const EdgeInsets.all(10),
                     child: CustomCarousel(
                       visible: 3,
                       borderRadius: 20,
                       slideAnimationDuration: 500,
                       titleFadeAnimationDuration: 300,
                       childClick: (int index) {
                         print("Clicked $index");
                       },
                       children: images,
                     ),
                   ),
                   Padding(
                     padding: EdgeInsets.all(MediaQuery.of(context).size.width /20),
                     child: const Column(
                       mainAxisAlignment: MainAxisAlignment.center,
                       children: [
                         Text("کیهان شناسی یا کوزمولوژی:",style: TextStyle(fontSize: 20,fontWeight: FontWeight.bold),textDirection: TextDirection.rtl,textAlign: TextAlign.right,),
                       ],
                     ),
                   ),
                   Padding(
                     padding: EdgeInsets.all(MediaQuery.of(context).size.width /20),
                     child: const Text("کیهان شناسی یا کوزمولوژی: شاخه‌ای از علوم طبیعی (از شاخه فیزیک) است که سرآغاز، فرگشت و سرانجام نهایی گیتی (فرجام‌شناسی) را مطالعه و بررسی می‌کند.\n مفهوم های (کیهان) و (جهان) در علم و فلسفه به معانی مختلفی استفاده میشوند. در ادامه توضیحی کوتاه درباره هر دو ارائه میدهم: \n\n کیهان: کیهان به معنای مجموعه ای است که شامل همه ی فضا، زمان، اجرام آسمانی، انرژی، ماده و قوانین فیزیکی است که در آن عمل میکنند. به طور خلاصه، کیهان به معنای تمام وجود و عالم است. در نظریه های فیزیکی مانند نظریه بیگ بنگ و نظریه نسبیت عام این مفهوم به کیهان به عنوان جهانی فراگیر و استمراری اشاره دارد.\n \n جهان: جهان به معنای محدوده ای از وجود است که شامل زمین، سیارات، ستارگان، کهکشان ها و اجرام آسمانی دیگر است. به طور خلاصه، جهان به معنای بخشی از کیهان است که مورد مطالعه و مشاده علمی قرار میگیرد. معمولا وقتی از (جهان) صحبت میکنیم، به مجموعه اجرام آسمانی و ساختار های بزرگتر مانند کهکشان ها و ستارگان اشاره داریم که در آن زندگی میکنیم.\n بنابراین، به طور خلاصه، کیهان به معنای تمام وجود و عالم است، در حالی که جهان به معنای بخشی از کیهان است که شامل اجرام آسمانی و ساختار های بزرگتر است که مورد مطالعه قرار میگرند.",style: TextStyle(fontSize: 18,),textDirection: TextDirection.rtl,textAlign: TextAlign.justify,),
                   ),
                   Padding(
                     padding: EdgeInsets.all(MediaQuery.of(context).size.width /20),
                     child: const Column(
                       mainAxisAlignment: MainAxisAlignment.center,
                       children: [
                         Text("نجوم چیست؟:",style: TextStyle(fontSize: 20,fontWeight: FontWeight.bold),textDirection: TextDirection.rtl,textAlign: TextAlign.right,),
                       ],
                     ),
                   ),
                   Padding(
                     padding: EdgeInsets.all(MediaQuery.of(context).size.width /20),
                     child: const Text("نجوم (Astronomy) علمی است که به مطالعه و تحقیق درباره اجرام آسمانی، مانند ستارگان، کهکشان‌ها، سیارات، ماه‌ها، سیارات کوچک، میان‌ستارگان، مجموعه‌های ستاره‌ای و سایر اجسام فضایی می‌پردازد. نجوم‌دانان با استفاده از تکنولوژی‌های پیشرفته و ابزارهای مشاهده، مشخصات، حرکات، تشکیل، تکامل و خصوصیات فیزیکی این اجسام را بررسی می‌کنند.\nنجوم به عنوان یکی از رشته‌های اصلی علوم طبیعی به ما کمک می‌کند تا به دانشی عمیق‌تر درباره ساختار و تاریخچه‌ی کیهان و جهان پی ببریم. این علم مبنایی برای مطالعه‌های مربوط به کیهان‌شناسی، فیزیک فضا، اخترفیزیک، برهم‌کنش‌های نجومی و سایر زمینه‌های مرتبط با آسمان‌شناسی فراهم می‌کند.\n هدف اصلی نجوم، درک عملکرد و خصوصیات فیزیکی اجسام آسمانی و تکوین و تکامل کیهان است. این شامل بررسی فیزیک ستارگان، نحوه تشکیل و تکامل کهکشان‌ها، بررسی جرم و ساختار سیارات و ماه‌ها، بررسی رویدادهای نجومی مانند انفجارات نووی و جرم‌کشی سیاه‌چاله‌ها و دیگر پدیده‌های فیزیکی مرتبط با آسمان می‌شود.\n  ",style: TextStyle(fontSize: 18,),textDirection: TextDirection.rtl,textAlign: TextAlign.justify,),
                   ),
                   Padding(
                     padding: EdgeInsets.all(MediaQuery.of(context).size.width /20),
                     child: const Column(
                       mainAxisAlignment: MainAxisAlignment.center,
                       children: [
                         Text("فواید دانستن علم نجوم:",style: TextStyle(fontSize: 20,fontWeight: FontWeight.bold),textDirection: TextDirection.rtl,textAlign: TextAlign.right,),
                       ],
                     ),
                   ),
                   Padding(
                     padding: EdgeInsets.all(MediaQuery.of(context).size.width /20),
                     child: const Text("کیهان‌شناسی، علمی است که درک ما را از کیهان و جهان وسیع اطرافمان توسعه می‌دهد. این علم بسیاری از فواید مهم و جذاب را برای انسان‌ها فراهم می‌کند. در زیر به برخی از فواید کیهان‌شناسی اشاره می‌کنم:\n 1.درک ما از جایگاه و مکانیک کیهان: کیهان‌شناسی به ما کمک می‌کند تا درک بهتری از جایگاه و مکانیک سیارات، ستارگان و سایر اجرام کیهانی داشته باشیم. با مطالعه کیهان‌شناسی، ما می‌توانیم بفهمیم که زمین ما در یک منظومه شمسی قرار دارد، که خورشید مرکز آن است، و کهکشان ما، راه شیری نیز در یک گروه از کهکشان‌ها قرار دارد. \n 2. درک تاریخچه کیهان: کیهان‌شناسی به ما اجازه می‌دهد تا تاریخچه کیهان را درک کنیم. با بررسی ستارگان، کهکشان‌ها و داده‌های کیهان‌شناسی، محققان توانسته‌اند نحوه شکل‌گیری و تکامل کیهان را بازسازی کنند. این بررسی‌ها به ما اطلاعاتی ارائه می‌دهند که به درک ما از شکل‌گیری ستارگان، تکامل کهکشان‌ها و پدیده‌های کیهانی مانند انفجارهای نووی و امواج گرانشی کمک می‌کنند.\n 3. شناخت ساختار کیهان: کیهان‌شناسی با مطالعه ساختار کیهان، از جمله کهکشان‌ها، خوشه‌های ستاره‌ای و فیلامان‌ها، به ما امکان می‌دهد تا به شکل و ساختار کیهانی که در آن زندگی می‌کنیم، بیشتر بپردازیم. ما می‌توانیم ساختار و توزیع ستارگان و سایر اجرام کیهانی را درک کنیم و به سوالاتی مانند چگونگی شکل‌گیری کهکشان‌ها و چگونگی توزیع ماده در کیهان پاسخ دهیم. \n 4. پیشرفت تکنولوژی: کیهان‌شناسی به پیشرفت تکنولوژی نیز کمک زیادی می‌کند. برای مطالعه کیهان، ما نیازمند ابزارهای پیشرفته‌ای مانند تلسکوپ‌ها، رادیوتلسکوپ‌ها، ماهواره‌ها و شتابدهنده‌ها هستیم. توسعه این ابزارتوسعه این ابزارها نه‌تنها به ما در درک بهتر کیهان کمک می‌کند، بلکه باعث پیشرفت تکنولوژی در زمینه‌های دیگر نیز می‌شود. به طور مثال، تکنولوژی‌های پیشرفته مورد استفاده در تلسکوپ‌ها و ماهواره‌ها، در تکنولوژی‌های پزشکی، مخابرات، ماده‌سازی و سایر صنایع نیز به کار می‌روند. \n 5. الهام‌بخشی و تحسین: کیهان‌شناسی و اکتشافات آن برای بسیاری از افراد الهام‌بخش و تحسین‌برانگیز است. شگفتی‌های کیهان و زیبایی‌های آسمان بالای ما، برای بسیاری از ماجراجویان، هنرمندان و علاقمندان به علم، منبع انرژی و الهام بخشی است. تحقیقات کیهان‌شناسی می‌تواند افراد را به سوی کشف و بررسی عمیق‌تر جهان بیرون از زمین سوق دهد و ارتباطی عمیق‌تر با جهان وسیع برقرار کند. \n 6. شناخت سیارات خارج از منظومه شمسی: کیهان‌شناسی به ما امکان می‌دهد تا سیاراتی که خارج از منظومه شمسی قرار دارند را بررسی کنیم. با استفاده از تلسکوپ‌ها و ماهواره‌ها، ما توانسته‌ایم سیاراتی را در دیگر سیستم‌های ستاره‌ای کشف کنیم و اطلاعاتی درباره خصوصیات آن‌ها، مانند اندازه، جرم، جو، و شرایط سطحی آن‌ها به دست آوریم. \n 7. جستجوی علائم زندگی در کیهان: یکی از مسائل مهم در کیهان‌شناسی، پیدا کردن نشانه‌های زندگی در جای دیگری در کیهان است. محققان به دنبال سیگنال‌هایی هستند که ممکن است به وجود زندگی در سیارات دیگر اشاره کنند. این شامل تحلیل جو، طیف‌سنجی سیارات دیگر، و جستجوی امضاهای شیمیایی و فیزیکی که ممکن است ناشی از فعالیت‌های زندگی باشد می‌شود. \n 8. مطالعه اجرام نجومی و پدیده‌های کیهانی: کیهان‌شناسی ما را قادر می‌سازد تا پدیده‌هایی را که در کیهان رخ می‌دهند بررسی کنیم. مانند انفجارهای نووی، ستاره‌های نیوترونی، پرتوهای گاما، سیاه چاله‌ها و پدیده‌هایی مانند تابش زمینه کیهانی. این مطالعات به ما کمک می‌کنند تا فهم بهتری از فیزیک بنیادی کیهان و پدیده‌های استثنایی آن پیدا کنیم. \n 9. اثرات کیهانی بر زمین و زندگی: مطالعه کیهان‌شناسی به ما می‌گوید که چگونه فرایندها و پدیده‌های کیهانی می‌توانند تأثیری بر زمین و زندگی داشته باشند. مانند انفجارهای نووی، خطرات سیاره‌های نزدیک به زمین، تغییرات آب و هوا و اثرات پدیده‌های فضایی بر فعالیت‌های ماهواره‌ها و سیستم‌های مخابراتی. \n 10. تکامل و آینده کیهان: کیهانشناخت تکامل کیهان و پیش‌بینی آینده آن نیز یکی از جنبه‌های مهم کیهان‌شناسی است. ما می‌دانیم که کیهان از زمان بزرگاندازی بیگ بنگ شکل گرفته است و در طول زمان تکامل یافته است. با استفاده از مدل‌های کیهان‌شناسی و داده‌های جمع‌آوری شده از تلسکوپ‌ها و ماهواره‌ها، ما می‌توانیم مدل‌هایی برای تکامل آینده کیهان ارائه دهیم. بررسی مسیرهای ممکن برای آینده کیهان، از جمله توسعه کیهان، سرنوشت سیارات و ستارگان، و احتمال تحولاتی مانند رشد سیاه چاله‌ها و انفجارهای نووی، موضوعاتی هستند که مورد مطالعه قرار می‌گیرند. \n این تنها چند مورد از فواید کیهان‌شناسی هستند. علم نجوم و کیهان‌شناسی هر روزه به دستاوردهای جدیدی دست می‌یابند و به درک ما از جهان وسیع کمک می‌کنند.",style: TextStyle(fontSize: 18,),textDirection: TextDirection.rtl,textAlign: TextAlign.justify,),
                   ),
                 ],
               ),
             ),
           ),
         ],
        ),
      ),
    );
  }
}
