import 'package:flutter/material.dart';

import '../Animations.dart';
import 'Animation.dart';

class Sun extends StatelessWidget {
  const Sun({super.key});
  @override
  Widget build(BuildContext context) {
    final List<Map<String, String>> images = [
      {"image": "assets/sun.jpg", "title": ""},
      {"image": "assets/sunfirst.jpg", "title": ""},
      {"image": "assets/sunSecond.jpg", "title": ""},
      {"image": "assets/sunThird.jpg", "title": ""},
      {"image": "assets/SunForth.jpg", "title": ""},
      {"image": "assets/sunFifth.jpg", "title": ""},
    ];
    return Scaffold(
      appBar: AppBar(
        centerTitle: false,
        title: Text(
          'خورشید',
          style: Theme.of(context)
              .textTheme
              .titleLarge!
              .copyWith(fontWeight: FontWeight.bold, color: Colors.white),
        ),
      ),
      body: Stack(
        children: [
          Positioned.fill(child: DrawerAnimation()),
          Scrollbar(
            radius: Radius.circular(10),
            child: SingleChildScrollView(
              child: Column(
                children: [
                  Container(
                    width: double.maxFinite,
                    height: 200,
                    padding: const EdgeInsets.all(10),
                    child: CustomCarousel(
                      visible: 3,
                      borderRadius: 20,
                      slideAnimationDuration: 500,
                      titleFadeAnimationDuration: 300,
                      childClick: (int index) {
                        print("Clicked $index");
                      },
                      children: images,
                    ),
                  ),
                  Padding(
                    padding: EdgeInsets.all(MediaQuery.of(context).size.width / 20),
                    child: const Text(
                      "خورشید، ستاره‌ای است که در مرکز سامانهٔ شمسی قرار دارد و نقش بسیار مهمی در زندگی و آبادانی بر روی زمین دارد. در زیر، به برخی از معلومات مهم دربارهٔ خورشید اشاره خواهم کرد: \n 1. اندازه و جرم: خورشید، ستاره‌ای با اندازه بزرگ است. قطر خورشید حدود 1.392 میلیون کیلومتر است که در مقایسه با قطر زمین حدود 109 برابر بزرگتر است. جرم خورشید نیز حدود 333 هزار برابر جرم زمین است. \n اگر خورشید را مثل یک سبت حساب کنید میتوانید 1300000 یک میلیون و سه صد هزار عدد کره زمین را درون این سبت جا دهید. \n 2. ترکیب شیمیایی: خورشید از یک مخلوط گازی تشکیل شده است. حدود ۷۴٪ از جرم خورشید را هیدروژن تشکیل می‌دهد، و ۲۵٪ آن را هلیم تشکیل می‌دهد. مابقی از جرم خورشید شامل عناصر سنگین‌تر مانند کربن، اکسیژن، آهن و نیکل است. \n 3. پدیده‌های خورشیدی: خورشید شامل مجموعه‌ای از پدیده‌های جالب و پرانرژی است. این پدیده‌ها شامل انفجارهای خورشیدی، پرتان‌های خورشیدی، لکه‌های خورشیدی و اشعهٔ همراه با باد خورشیدی می‌شوند. \n 4. فرآیندهای داخلی: خورشید از طریق فرآیند هسته‌ای شناخته شده به عنوان هسته هیدروژن به هلیم (فرآیند هسته‌ای همجوشی)، انرژی را تولید می‌کند. این فرآیند، در هسته خورشید در دماهای بسیار بالا و فشارهای زیادی اتفاق می‌افتد و انرژی خورشیدی را تأمین می‌کند. \n 5. تأثیر خورشید بر زمین: خورشید تأثیرات فراوانی بر روی زمین دارد. منابع نور و حرارت خورشیدی، اقلیم زمین را تحت تأثیر قرار می‌دهند و پدیده‌هایی مانند آب و هوا، فصول سال، جریان‌های اقیانوسی و سایر عوامل زمین‌شناسی را تحت تأثیر قرار می‌دهند.\n 6. دمای انرژی خورشید: دمای انرژی خورشید، که به عنوان دمای تابشی خورشید نیز شناخته می‌شود، در محدوده‌های مختلف قابل تفاوت است. این دما به شدت به محلی از خورشید که در نظر گرفته می‌شود بستگی دارد. \n دمای مرکز خورشید، یعنی هسته خورشید، به تقریباً ۱۵ میلیون درجه سانتیگراد (میلیون درجه کلوین) می‌رسد. در این ناحیه، فشار و دما به اندازه‌ای بالاست که فرآیند هسته‌ای همچون هسته‌زایی هیدروژن به هلیوم رخ می‌دهد. \n دمای سطح خورشید (ناحیه‌ای که از آن تابش خورشید به ما می‌رسد) حدوداً ۵٬۵۰۰ درجه سانتیگراد (۵٬۷۷۳ کلوین) است. این دما کمتر از دمای هسته است، اما باز هم بسیار بالاست و باعث می‌شود خورشید به عنوان یک منبع قدرتمند از تابش حرارتی و نوری برای سیستم شمسی و سیارات منظومه شمسی عمل کند. \n 7. طول عمر خورشید: خورشید تقریباً 4.6 میلیارد سال پیش شکل گرفته است و به تقریباً 5 میلیارد سال دیگر، در طول فرآیندی به نام زمانهای هسته‌ای، به هلیوم تبدیل خواهد شد. این فرآیند تولید انرژی خورشیدی را در طول عمر خورشید حفظ می‌کند.\n 8. خورشید در سیستم شمسی: خورشید در مرکز سیستم شمسی قرار دارد و سایر سیارات و اجرام به دور آن می‌گردند. خورشید حدود 99.86 درصد جرم کل سیستم شمسی را تشکیل می‌دهد و نقش مرکزی در استقرار و پایداری سیستم شمسی دارد.\n 9.چرخش: خورشید به شکلی کروی دورانی چرخان است. به علت اختلاف در سرعت چرخشی میان مناطق قطبی و استوا، خورشید در سطح خود الگوهایی از لکه‌های خورشیدی را نمایش می‌دهد که به عنوان چرخش خورشیدی معروف است. \n 10. جاذبه خورشید، به دلیل جرم بسیار بزرگ آن، بسیار قوی است. مقدار شتاب گرانشی یا جاذبه سطح خورشید، حدود ۲۷٫۹۴ متر بر ثانیه مربع است. این به این معنی است که در سطح خورشید، یک جسم که به فاصله یک متر از مرکز خورشید قرار داشته باشد، تحت تأثیر نیرویی قرار خواهد گرفت که به بیش از ۲۷٫۹۴ متر بر ثانیه به سمت مرکز خورشید کشیده می‌شود. \n این مقدار جاذبه خورشید به معنای آن است که جاذبه خورشیدی نسبت به جاذبه زمین بسیار قوی‌تر است. به عنوان مقایسه، شتاب گرانشی یا جاذبه سطح زمین حدود ۹٫۸۱ متر بر ثانیه مربع است. بنابراین، جاذبه خورشید تقریباً سه برابر جاذبه زمین است. \n این قدرت جاذبه خورشید مسئول نگهداشتن سیارات و سایر اجسام منظومه شمسی در حرکت مداری منظم حول خورشید است.",
                      style: TextStyle(
                        fontSize: 18,
                      ),
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                    ),
                  ),
                  Padding(
                    padding: EdgeInsets.all(MediaQuery.of(context).size.width / 20),
                    child: const Column(
                      mainAxisAlignment: MainAxisAlignment.center,
                      children: [
                        Text(
                          "چگونه جاذبه خورشید مسئول نگهداشتن سیارات در حرکت مداری است؟",
                          style: TextStyle(
                              fontSize: 20,
                              fontWeight: FontWeight.bold,
                              color: Colors.redAccent),
                          textDirection: TextDirection.rtl,
                          textAlign: TextAlign.right,
                        ),
                      ],
                    ),
                  ),
                  Padding(
                    padding: EdgeInsets.all(MediaQuery.of(context).size.width / 20),
                    child: const Text(
                      "جاذبه خورشید نقش بسیار مهمی در نگهداشتن سیارات در حرکت مداری خود بازی می‌کند. برای توضیح این مسئله، باید به نظریه نیوتن درباره جاذبه و قوانین حرکت سیارات مراجعه کنیم. \n طبق قوانین نیوتن، هر جسم با جرمی مانند سیاره‌ها و ستارگان، نیروی جاذبه‌ای به وجود می‌آورد که متناسب با جرم آن جسم و برعکس متناسب با مربع فاصله از آن جسم است. به عبارت دیگر، نیروی جاذبه بین دو جسم، مانند سیاره و خورشید، با افزایش جرم آن‌ها و کاهش فاصله بین آن‌ها افزایش می‌یابد. \n در مورد سیارات در منظومه شمسی، جاذبه خورشید نیرویی است که سعی می‌کند سیارات را به سمت مرکز خورشید کشش دهد. به عنوان مثال، برای سیاره زمین، جاذبه خورشید سعی می‌کند زمین را به سمت خود کشش دهد. اما به دلیل حرکت دورانی زمین، نیروی مرکزگرایی نیز وجود دارد که سعی می‌کند زمین را به سمت مرکز خود، یعنی مرکز دوران زمین، جلب کند. \n نتیجه این دو نیرو، حرکت مداری سیاره در مسیری به نام مدار مستقیم را به وجود می‌آورد. در واقع، سیاره در حالی که جاذبه خورشید را تجربه می‌کند، به دور خورشید در یک مسیر بسته حرکت می‌کند که به آن مدار مستقیم یا مدار الیپسی گفته می‌شود. \n به طور خلاصه، جاذبه خورشید با کشش نیروی جاذبه، سیارات را در مدارهای خود نگه می‌دارد و آن‌ها را در حرکت مداری مستقیم حول خود جلب می‌کند.",
                      style: TextStyle(
                        fontSize: 18,
                      ),
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                    ),
                  ),
                  Padding(
                    padding: EdgeInsets.all(MediaQuery.of(context).size.width / 20),
                    child: const Column(
                      mainAxisAlignment: MainAxisAlignment.center,
                      children: [
                        Text(
                          "چرا سیارات در حرکت مداری خود به دور خورشید حرکت می‌کنند؟",
                          style: TextStyle(
                              fontSize: 20,
                              fontWeight: FontWeight.bold,
                              color: Colors.redAccent),
                          textDirection: TextDirection.rtl,
                          textAlign: TextAlign.right,
                        ),
                      ],
                    ),
                  ),
                  Padding(
                    padding: EdgeInsets.all(MediaQuery.of(context).size.width / 20),
                    child: const Text(
                      "حرکت مداری سیارات به دور خورشید نتیجه تعامل نیروی گرانشی بین خورشید و سیارات است. برای درک بهتر این مسئله، می‌توانید به دو قانون اساسی در فیزیک تعامل جاذبه نیوتن مراجعه کنید: \n 1. قانون جاذبه نیوتن: نیروی جاذبه بین دو جسم متناسب با جرم آن‌ها و برعکس متناسب با مربع فاصله آن‌ها است. با افزایش جرم سیاره و خورشید، نیروی جاذبه بین آن‌ها افزایش می‌یابد. \n 2. قانون حرکت نیوتن: هر جسمی که نیروی نسبی به آن اعمال شود، حرکت می‌کند. این حرکت در جهتی است که نیروی جاذبه به آن جسم اعمال می‌شود. \n \n بنابراین، وقتی یک سیاره به دور خورشید حرکت می‌کند، نیروی جاذبه خورشید بر روی آن سیاره اعمال می‌شود. این نیرو به سمت مرکز خورشید جهت دارد و درنتیجه، سیاره تحت تأثیر این نیرو به سمت خورشید کشیده می‌شود.\n با این حال، به علت حرکت مستقیم سیاره و نیروی مرکزگرایی، سیاره در حقیقت در حال حرکت در یک مسیر منحنی به نام مدار الیپسی یا مدار بسته است. این مدار، تعادل بین نیروی جاذبه خورشید و نیروی مرکزگرایی سیاره را برقرار می‌کند و سیاره را در مسیر مداری ثابت نگه می‌دارد. \nبه طور خلاصه، سیارات در حرکت مداری خود به دور خورشید حرکت می‌کنند به دلیل تعامل نیروی جاذبه خورشید و نیروی مرکزگرایی سیاره که با هم تعادل می‌یابند و سیاره را در مسیر مداری ثابت نگه می‌دارند.",
                      style: TextStyle(
                        fontSize: 18,
                      ),
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                    ),
                  ),
                  Padding(
                    padding: EdgeInsets.all(MediaQuery.of(context).size.width / 20),
                    child: const Column(
                      mainAxisAlignment: MainAxisAlignment.center,
                      children: [
                        Text(
                          "خورشید چگونه انرژی نور و حرارت را تولید می‌کند؟",
                          style: TextStyle(
                              fontSize: 20,
                              fontWeight: FontWeight.bold,
                              color: Colors.redAccent),
                          textDirection: TextDirection.rtl,
                          textAlign: TextAlign.right,
                        ),
                      ],
                    ),
                  ),
                  Padding(
                    padding: EdgeInsets.all(MediaQuery.of(context).size.width / 20),
                    child: const Text(
                      "خورشید، انرژی نور و حرارت را از طریق فرایندهای هسته‌ای درونی خود تولید می‌کند. این فرایندها در هستهٔ خورشید رخ می‌دهند و به عنوان هسته‌زایی هیدروژن به هلیم شناخته می‌شوند. فرایند اصلی که در خورشید رخ می‌دهد، به نام فرایند هسته‌زایی هستروژن به هلیم (nuclear fusion of hydrogen) معروف است. \n در هستهٔ خورشید، دمای و فشار به اندازهٔ کافی بالاست تا اتم‌های هیدروژن به یکدیگر نزدیک شوند و فرایند هسته‌زایی را آغاز کنند. در این فرایند، دو اتم هیدروژن با هسته‌های پروتونی خود به هم می‌چسبند و یک هستهٔ هلیم تشکیل می‌دهند. در این فرآیند، مقدار بسیار کمی از جرم اتم‌ها به انرژی تبدیل می‌شود، مطابق با معادلهٔ اینشتین (E=mc²)، که در آن E نشان‌دهندهٔ انرژی، m نشان‌دهندهٔ جرم، و c نشان‌دهندهٔ سرعت نور است.",
                      style: TextStyle(
                        fontSize: 18,
                      ),
                      textDirection: TextDirection.rtl,
                      textAlign: TextAlign.justify,
                    ),
                  ),
                ],
              ),
            ),
          ),
        ],
      ),
    );
  }
}
