import 'package:flutter/material.dart';

import '../animation.dart';
import 'animation.dart';


class Uranos extends StatelessWidget {
  const Uranos({super.key});
  @override
  Widget build(BuildContext context) {
    final List<Map<String, String>> images = [
      {"image": "assets/Uranus4.jpg", "title": ""},
      {"image": "assets/Uranus3.jpg", "title": ""},
      {"image": "assets/Uranus2.jpg", "title": ""},
      {"image": "assets/Uranus1.jpg", "title": ""},
      {"image": "assets/Uranus7.jpg", "title": ""},
      {"image": "assets/Uranus6.jpg", "title": ""},
    ];
    return Scaffold(
      appBar: AppBar(
        centerTitle: false,
        title: Text(
          'اورانوس',
          style: Theme.of(context)
              .textTheme
              .titleLarge!
              .copyWith(fontWeight: FontWeight.bold,color: Colors.white),
        ),
      ),
      body: SafeArea(
        child: Stack(
          children: [
            const Positioned.fill(child: DrawerAnimation()),
            Scrollbar(
              radius: Radius.circular(10),
              child: SingleChildScrollView(
                child: Column(
                  children: [
                    Container(
                      width: double.maxFinite,
                      height: 200,
                      padding: const EdgeInsets.all(10),
                      child: CustomCarousel(
                        visible: 3,
                        borderRadius: 20,
                        slideAnimationDuration: 500,
                        titleFadeAnimationDuration: 300,
                        children: images,
                      ),
                    ),
                    Padding(
                      padding: EdgeInsets.all(MediaQuery.of(context).size.width /20),
                      child: const Text("اورانوس هفتمین سیاره از نظر نزدیکی به خورشید و سومین سیاره از نظر اندازه و چهارمین سیاره از نظر جرم در سامانه خورشیدی است. اورانوس هر ۸۴ سال و ۷ روز یکبار به دور خورشید می‌گردد. همچنین هر ۱۷ ساعت و ۱۴ دقیقه یک دور به دور خودش می‌چرخد. اورانوس دارای بیش از ۲۷ قمر است که میراندا، آریل، آمبریل، تیتانیا و اوبرون از شناخته‌شده‌ترین آن‌ها هستند. این سیاره را ویلیام هرشل در سال ۱۷۸۱ میلادی کشف کرد.\n اورانوس یکی از سیارات هشت‌گانهٔ منظومهٔ خورشیدی که از لحاظ بُعد فاصله‌اش نسبت به خورشید در ردیف هفتم پس از کیوان (زحل) قرار گرفته‌است. فاصلهٔ متوسط این سیاره تا خورشید ۲٬۸۶۹٬۶۰۰٬۰۰۰ کیلومتر و ۱۴٫۵ بار از کرهٔ زمین بزرگ‌تر است. اورانوس ۲۷ ماه طبیعی دارد. این سیاره با چشم غیرمسلح دیده نمی‌شود. محور حرکت وضعی این سیاره کاملاً با مدار حرکت انتقالی‌اش منطبق است. سفرهای اکتشافی به این سیاره کمتر از ده مأموریت بوده که شاخص‌ترینش مأموریت وویجر ۲ بود که این فضاپیما در ژانویهٔ ۱۹۸۶ به آن رسید.\n\n  کشف:\n این سیاره قبل از کشف به‌صورت یک ستاره در کاتالوگ جان فلاستمد در سال ۱۶۹۰ به عنوان ستاره «۳۴ ثور» ثبت شده بود. اخترشناس فرانسوی پیر لمونیر این سیاره را بین ۱۷۵۰ تا ۱۷۶۹ دوازده بار (با در نظر گرفتن ۴ شب متوالی) رصد کرده بود.\n ولی توسط ویلیام هرشل و در خانه‌اش (اکنون موزه اخترشناسی) در شهر بث، سامرست و در ۱۳ مارس ۱۷۸۱ رصد شد، و در ۲۶ آوریل ۱۷۸۱ به‌عنوان دنباله‌دار گزارش شد. هرشل آن را به عنوان جرمی که در برابر ستارگان اختلاف منظر دارد گزارش داد، او این‌گونه در ژورنال نگاشت: «در نزدیکی زتا ثور … یا یک سحابی است یا یک دنباله‌دار». در ۱۷ مارس نگاشت: «به دنبال سحابی یا دنباله‌دار به این نتیجه رسیدم که دنباله‌دار است زیرا جایش را تغییر می‌دهد». و حتی هنگامی که این جرم را به عنوان کشف به انجمن سلطنتی گزارش می‌داد باز بر این باور بود که دنباله‌دار است و این عقیده را داشت تا زمانی که به‌طور مطلق اثبات شد که اورانوس یک سیاره است.\n 1.موقعیت و خصوصیات: اورانوس یکی از سیاره‌های دورترین منظومهٔ شمسی است و در فاصلهٔ تقریباً ۲۸۰۰ میلیون مایل (۴۵۰۰ میلیون کیلومتر) از خورشید قرار دارد. اورانوس به عنوان یک سیارهٔ غازی شناخته می‌شود و در برابر سایر سیاره‌ها، محور چرخش آن بطور نامعمولی به یک زاویهٔ تقریباً ۹۰ درجه نسبت به جهت حرکت در مدار خود برگردانده است، که این خصوصیت یکی از ویژگی‌های بارز آن است.\n2. ساختار: اورانوس نیز مانند مشتری، سیارهٔ گازی است و دارای جوی ضخیم از هیدروژن و هلیم است. در برابر سایر سیاره‌های منظومهٔ شمسی، اورانوس دارای ساختاری منحصر به فرد است. این سیاره دارای لایه‌هایی از آب مایع، متان و هیدروژن یونیزه شده درون خود است. عمدهٔ ابرهای اورانوس در لایهٔ اتمسفری مشترکاً متشکل از متان و ابرهای یخی هستند.\n3. حلقه‌ها: اورانوس دارای سیستمی از حلقه‌ها است که به نظر می‌رسد از ذرات یخی و دیگر مواد تشکیل شده‌اند. این حلقه‌ها نسبت به حلقه‌های سایر سیاره‌های خورشیدی ضعیف‌تر هستند و در مقایسه با حلقه‌های مشتری و ساتورن، دیداری کمتری دارند.\n4. ماه ها: اورانوس دارای حدود 27 ماه شناخته شده است. برخی از ماه های معرفو اورانوس عبارتند از: تیتانیا، اوبریل، اریل، امبیریا، پروسپریا و میراندا. میراندا، با کوه‌ها و خنده‌های شدید، به عنوان یکی از ماه‌های جالب و بی‌نظم اورانوس مشهور است.\n5. ماموریت های فضایی: تاکنون تنها یک ماموریت فضایی به اورانوس ارسال شدهاست. ماهموریت (ویجر ۲) که در سال ۱۹۸۶ انجام شد، عکس ها و داده های مهمی از اورانوس به دست آورد. این ماموریت به ماه اطلاعات بیشتری در باره ساختار، جو، حلقه ها و ماه های اورانوس ارائه کرد. \n در کل، اورانوس یک سیاره منحصر به فرد با ساختار و خصوصیات مختصری است. با توجه به فاصله بزرگی که از خورشید دارد و ویژگی های منحصر به فردی که دارد، بررسی و بررسی علمی بیشتری برای درک کامل این سیاره نیاز است.",style: TextStyle(fontSize: 18,),textDirection: TextDirection.rtl,textAlign: TextAlign.justify,),
                    ),
                  ],
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }
}


