import 'package:flutter/material.dart';

import '../animation.dart';
import 'animation.dart';


class venus extends StatelessWidget {
  const venus({super.key});
  @override
  Widget build(BuildContext context) {
    final List<Map<String, String>> images = [
      {"image": "assets/solar-venus.png", "title": ""},
      {"image": "assets/venus.png", "title": ""},
      {"image": "assets/venus1.png", "title": ""},
      {"image": "assets/venus2.png", "title": ""},
      {"image": "assets/mercure4.png", "title": ""},
    ];
    return Scaffold(
      appBar: AppBar(
        centerTitle: false,
        title: Text(
          'زهره',
          style: Theme.of(context)
              .textTheme
              .titleLarge!
              .copyWith(fontWeight: FontWeight.bold,color: Colors.white),
        ),
      ),
      body: SafeArea(
        child: Stack(
         children: [
           const Positioned.fill(child: DrawerAnimation()),
           Scrollbar(
             radius: Radius.circular(10),
             child: SingleChildScrollView(
               child: Column(
                 children: [
                   Container(
                     width: double.maxFinite,
                     height: 200,
                     padding: const EdgeInsets.all(10),
                     child: CustomCarousel(
                       visible: 3,
                       borderRadius: 20,
                       slideAnimationDuration: 500,
                       titleFadeAnimationDuration: 300,
                       children: images,
                     ),
                   ),
                   Padding(
                     padding: EdgeInsets.all(MediaQuery.of(context).size.width /20),
                     child: const Text("زهره (ناهید)، سومین سیارهٔ نزدیکتر به خورشید در سامانهٔ شمسی ما است. این سیاره به علت زیبایی و درخشش خود، اغلب به عنوان (ستارهٔ صبح) یا (ستارهٔ عصر) شناخته می‌شود. در زبان یونانی باستان، زهره با نام ناهید شناخته می‌شد که در اساطیر یونانی به عنوان خدای زیبایی و عشق شناخته می‌شد. \n در زمان خروجی از مشتری (پیکارس)، زهره به عنوان یکی از سیاره‌های بازتاب‌کنندهٔ بالا شناخته شده است. این به این معنی است که زهره نور خورشید را به شدت منعکس می‌کند و در آسمان شب به شکلی بسیار درخشان ظاهر می‌شود. این خاصیت باعث می‌شود زهره در آسمان به عنوان یک نقطهٔ بسیار درخشان قابل رؤیت باشد. \n زهره دارای ویژگی‌های منحصر به فردی است که آن را از سایر سیاره‌ها متمایز می‌کند. این سیاره دارای جوی غلیظ است که به طور اساسی از دی اکسید کربن تشکیل شده است و دارای یک اثر گلخانه‌ای قوی است. این اثر گلخانه‌ای باعث افزایش دما در سطح زهره می‌شود و باعث می‌شود که زهره یکی از سیاره‌های گرمتر در سامانهٔ شمسی باشد. این دمای بسیار بالا و فشار قوی در سطح زهره، باعث شده است که سطح زهره به شدت غیرقابل سکونت و بسیار سخت باشد. \n همچنین، زهره یکی از اندک سیاره‌هایی است که دوران خود را به خلاف جهت دوران سایر سیاره‌ها پیرامون خورشید انجام می‌دهد. این به این معنی است که زهره در جهت عقربه‌های ساعت می‌چرخد در حالی که بسیاری از سیاره‌ها در جهت عکس عقربه‌های ساعت می‌چرخند. \n از نظر مطالعات علمی، زهره همچنین مورد توجه قرار گرفته است. ناسا (سازمان فضایی آمریکا) و سایر سازمان‌های فضایی به دلیل شرایط بی‌سابقهٔ سطح زهره، بارها مأموریت‌هایی برای مطالعهٔ آن ارسال کرده‌اند. این مأموریت‌ها شامل ماهپوینتر (Venus Express) و میشا (Akatsuki) بوده است. این مأموریت‌ها به ما کمک کرده‌اند تا بیشتر دربارهٔ جو، اقلیم و ساختار زهره بیاموزیم. \n به طور خلاصه، زهره یکی از سیاره‌های نزدیک به خورشید در سامانهٔ شمسی است. این سیاره به عنوان ستارهٔ صبح یا عصر به دلیل درخشش خود شناخته می‌شود. دارای جوی فوق‌بازتاب‌کننده و اثر گلخانه‌ای قوی است. سطح زهره غیرقابل سکونت است و دارای دوران مخالف با سایر سیاره‌های شمسی است. مأموریت‌های فضایی برای مطالعهٔ زهره در جهت بهتر درک این سیاره تاکنون انجام شده است. \n1. موقعیت و خصوصیات: زهره در منظومهٔ شمسی قرار گرفته و بین مدار عطارد و مدار زمین قرار دارد. این سیاره در اندازهٔ و وزنی مشابه زمین است و به عنوان سیارهٔ خواهر زمین شناخته می‌شود. \n 2. جرم و قطر: جرم زهره تقریباً ۸۱٪ جرم زمین است و قطر آن نزدیک به ۹۵٪ قطر زمین است. این به معنای این است که زهره اندکی کوچکتر و سبک‌تر از زمین است. \n 3. جو و اثر گلخانه‌ای: زهره یک جوی چگال دارد که از اکسیژن و دی اکسید کربن تشکیل شده است. این جو، از بخار آب فراوانی نیز تشکیل شده است و اثر گلخانه‌ای بسیار قوی دارد. نتیجتاً دمای سطح زهره بسیار بالاست و بیشترین دما در سیارهٔ ما شناخته شده است. \n 4. روز و شب: زهره همچون عطارد دوران چرخش خود را به دور محور خود در جهت عقربه‌های ساعت انجام می‌دهد. اما بر خلاف عطارد که یک روز بسیار کوتاه دارد، زهره یک روز بسیار طولانی دارد که حدوداً ۱۱۷ روز زمینی است. این به معنای این است که زهره نیمی از سال را در روز قرار می‌دهد و نیمی دیگر را در شب. \n 5. سطح و زمینه‌های جغرافیایی: سطح زهره در برخی نواحی با کوهستان‌ها و حفره‌های عمیق پر از آتشفشان‌ها پراکنده است. این آتشفشان‌ها فعالیت شدیدی در گذشته داشته‌اند و ممکن است در برخی مناطق هنوز هم فعال باشند. \n 6. نوارهای نوری: زهره دارای نوارهای نوری است که به آن به عنوان (نوارهای ناهیدی) یا (نوارهای اشعهٔ آنتی‌توسکانا) معروف است. این نوارها ناشی از پراکندگی نور در جوی غنی از بخار آب هستند. \n 7. ماموریت های فضایی: چندین ماموریت فضایی به زهره صورت گرفته است. برخی از این ماموریت ها شامل ماموریت مارینر 2 و 5، ونوس ایکسپرس، و ماموریت بی بی سی روسیه به نام ونوس-د، میباشند. این ماموریت ها به منظور بررسی جزئیات بیشتر در مورد جو و سطح زهره، ترکیب شیمیایی آن، بررسی آتشفشان ها و ساختار جغرافیایی زهره، صورت گرفته اند. \n موجودات زنده در زهره به دلیل شرایط سخت سطح و دمای بسیار بالا و فشار بیش از حد، احتمالاً وجود ندارد. بنابراین، بررسی آن برای شناخت محیط زندگی مانند زمین مهم است.",style: TextStyle(fontSize: 18,),textDirection: TextDirection.rtl,textAlign: TextAlign.justify,),
                   ),
                 ],
               ),
             ),
           ),
         ],
        ),
      ),
    );
  }
}


